# -*- line-spacing: 0.1; -*-
#+TITLE: Floating Island - ISDP Group 33
#+STARTUP: latexpreview
#+STARTUP: overview
#+INCLUDE: "~/.doom.d/orgReportHeader.org"
#+OPTIONS: H:3 d:nil tags:nil email:nil author:nil toc:nil broken-links:t ^:nil #\n:t

#+Caption: Authors
#+ATTR_LATEX: placement [H] :booktabs t:
| Last Name     | Forename    | Student number |
|---------------+-------------+----------------|
| Ameh          | Ilebo Naomi | 2655446A       |
| Bai           | Jingwei     | 2698327B       |
| Deng          | Binbin      | 2631250D       |
| Frazer        | Benjamin    | 2704250F       |
| Gao           | Baorong     | 2637530G       |
| Hu            | Yike        | 2748951H       |
| Huo           | Kairun      | 2674596H       |
| Shiyamsunthar | Partheepan  | 2531525S       |
| Xiao          | Yao         | 2630063X       |
| Zhu           | Xu          | 2669120Z       |

@@latex:\tableofcontents@@

** =ReadCsv()=
#+NAME: readCsv
#+BEGIN_SRC jupyter-python :session test :var file2read="Tables/exampleTable.csv"
import pandas as pd
def readCsv(path):
    data=pd.read_csv(path)
    headings = list(data)
    table= [list(data.iloc[i]) for i in range(len(data))]
    table.insert(0,None)
    table.insert(0,headings)
    display(table)
readCsv(file2read)
#+End_src

#+RESULTS: readCsv
| Heading 1    | Heading 2    | Heading 3   |
|--------------+--------------+-------------|
| value col1r1 | value col2r1 | valuecol3r1 |
| value col1r2 | value col2r2 | valuecol3r2 |
| value col1r3 | value col2r3 | valuecol3r3 |


#+RESULTS:
